11/data/attachments/70ee87619c737c56.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_e59f2556-6736-4b0d-8912-88340d030e1a</nif:username>
            <nif:friendToBeAdded>Amanda_level_Friend_24336_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>